In [1]:
# HIDDEN

from datascience import *
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')
%matplotlib inline

### Tables

Tables are a fundamental object type for representing data sets. A table can be viewed in two ways. Tables are a sequence of named columns that each describe a single aspect of all entries in a data set. Tables are also a sequence of rows that each contain all information about a single entry in a data set. 

Tables are typically created from files that contain comma-separated values, called CSV files. The file below contains "Annual Estimates of the Resident Population by Single Year of Age and Sex for the United States."

In [2]:
census_url = 'http://www.census.gov/popest/data/national/asrh/2014/files/NC-EST2014-AGESEX-RES.csv'
full_table = Table.read_table(census_url)
full_table

A [description of the table](http://www.census.gov/popest/data/national/asrh/2014/files/NC-EST2014-AGESEX-RES.pdf) appears online. The `SEX` column contains numeric codes: `0` stands for the total, `1` for male, and `2` for female. The `AGE` column contains ages, but the special value `999` is a sum of the total population. The rest of the columns contain estimates of the US population.

Typically, a public table will contain more information than necessary for a particular investigation or analysis. In this case, let us suppose that we are only interested in the population changes from 2010 to 2014. We can select only a subset of the columns using the `select` method.

In [3]:
census = full_table.select(['SEX', 'AGE', 'POPESTIMATE2010', 'POPESTIMATE2014'])
census

The names used for columns in the original table can be changed, often to clarify or simplify future computations. Be careful, the `relabel` method does alter the table, so that the original name is lost.

In [4]:
census.relabel('POPESTIMATE2010', '2010')
census.relabel('POPESTIMATE2014', '2014')
census

Each column of a table is an array of the same length, and so columns can be combined. Columns are accessed and assigned by name using square brackets.

In [5]:
census['Change'] = census['2014'] - census['2010']
census['Growth'] = census['Change'] / census['2010']
census

Although the columns of this table are simply arrays of numbers, the format of those numbers can be changed to improve the interpretability of the table. The `set_format` method takes `Formatter` objects, which exist for dates (`DateFormatter`), currencies (`CurrencyFormatter`), numbers, and percentages.

In [6]:
census.set_format('Growth', PercentFormatter)
census.set_format(['2010', '2014', 'Change'], NumberFormatter)
census

The information in a table can be accessed in many ways. The attributes `column_labels`, `columns`, and `rows` demonstrated below are used for any table.

In [7]:
census.column_labels

('SEX', 'AGE', '2010', '2014', 'Change', 'Growth')

In [8]:
len(census)

6

In [9]:
len(census.rows)

306

In [10]:
census.rows[0]

Row(SEX=0, AGE=0, _2=3951330, _3=3948350, Change=-2980, Growth=-0.00075417644185628633)

In [11]:
census.columns[2]

array([  3951330,   3957888,   4090862,   4111920,   4077552,   4064653,
         4073013,   4043047,   4025604,   4125415,   4187063,   4115511,
         4113280,   4119666,   4145614,   4231003,   4313252,   4376368,
         4491005,   4571385,   4568470,   4387914,   4286987,   4217221,
         4243589,   4289424,   4160810,   4237010,   4247540,   4210285,
         4304244,   4042507,   3967603,   3933570,   3822188,   3948318,
         3830202,   3896776,   4080229,   4324460,   4387483,   4163470,
         4082733,   4093841,   4178501,   4438551,   4529712,   4535464,
         4534669,   4599102,   4646251,   4498994,   4480630,   4439422,
         4288475,   4259012,   4093161,   3946548,   3802467,   3694276,
         3616733,   3520121,   3495073,   3652174,   2706063,   2678532,
         2621346,   2693709,   2359819,   2167833,   2062581,   1953614,
         1883821,   1750309,   1685999,   1631879,   1481683,   1449173,
         1402184,   1354913,   1319725,   1212603,   1158352,   1081442,
          987026,    915015,    821550,    721195,    636657,    546193,
          448323,    344443,    288841,    219063,    170775,    131077,
           97161,     68893,     47037,     32178,     54409, 309347057,
         2018420,   2020332,   2088685,   2101272,   2084312,   2076573,
         2079410,   2063139,   2054462,   2107037,   2142168,   2104797,
         2103650,   2104949,   2122913,   2170442,   2215032,   2252838,
         2305733,   2334906,   2331846,   2241095,   2188228,   2151095,
         2161380,   2177171,   2102375,   2135214,   2135020,   2112348,
         2167540,   2026467,   1986185,   1963676,   1908761,   1974660,
         1907447,   1934572,   2028088,   2148755,   2189556,   2073925,
         2031830,   2031012,   2074606,   2201934,   2238804,   2237972,
         2235326,   2262482,   2290902,   2209830,   2197222,   2170965,
         2091677,   2075250,   1984480,   1910028,   1838703,   1779504,
         1742232,   1691413,   1679074,   1753914,   1291843,   1272693,
         1239805,   1270148,   1105702,   1006786,    954076,    903263,
          862528,    794646,    758831,    725664,    653551,    630867,
          602774,    573884,    549215,    496069,    462807,    423000,
          375687,    337662,    295395,    253620,    216220,    180461,
          141398,    104291,     83462,     60182,     43828,     31736,
           22022,     14775,      9504,      6104,      9351, 152089484,
         1932910,   1937556,   2002177,   2010648,   1993240,   1988080,
         1993603,   1979908,   1971142,   2018378,   2044895,   2010714,
         2009630,   2014717,   2022701,   2060561,   2098220,   2123530,
         2185272,   2236479,   2236624,   2146819,   2098759,   2066126,
         2082209,   2112253,   2058435,   2101796,   2112520,   2097937,
         2136704,   2016040,   1981418,   1969894,   1913427,   1973658,
         1922755,   1962204,   2052141,   2175705,   2197927,   2089545,
         2050903,   2062829,   2103895,   2236617,   2290908,   2297492,
         2299343,   2336620,   2355349,   2289164,   2283408,   2268457,
         2196798,   2183762,   2108681,   2036520,   1963764,   1914772,
         1874501,   1828708,   1815999,   1898260,   1414220,   1405839,
         1381541,   1423561,   1254117,   1161047,   1108505,   1050351,
         1021293,    955663,    927168,    906215,    828132,    818306,
          799410,    781029,    770510,    716534,    695545,    658442,
          611339,    577353,    526155,    467575,    420437,    365732,
          306925,    240152,    205379,    158881,    126947,     99341,
           75139,     54118,     37533,     26074,     45058, 157257573])

In [12]:
census.rows[0][2]

3951330

In [13]:
census.columns[2][0]

3951330

Let's take a look at the growth rates of the total number of males and females by selecting only the *rows* that sum over all ages. This sum is expressed with the special value `999` according to this data set description.

In [14]:
census.where('AGE', 999)

What ages of males are driving this rapid growth? We can first filter the `census` table to keep only the male entries, then sort by growth rate in decreasing order.

In [15]:
males = census.where('SEX', 1)
males.sort('Growth', descending=True)

The fact that there are more men with `AGE` of 100 than 99 looks suspicious; shouldn't there be fewer? A careful look at the description of the data set reveals that the 100 category actually includes all men who are 100 or older. The growth rates in men at these very old ages could have several explanations, such as a large influx from another country, but the most natural explanation is that people are simply living longer in 2014 than 2010.

The `where` method can also take an array of boolean values, constructed by applying some comparison operator to a column of the table. For example, we can find all of the age groups among both sexes for which the absolute `Change` is substantial. The `show` method displays all rows without abbreviating.

In [16]:
both = census.where(census['SEX'] != 0)
both.where(both['Change'] > 200000).sort('AGE').show()

Many of the same ages appear for both males (`1`) and females (`2`), and most are clumped together in the 57-67 range. In 2014, these people would be born between 1947 and 1957, the height of the post-WWII baby boom in the United States.

It is possible to specify multiple conditions using the functions `np.logical_and` and `np.logical_or`. When two conditions are combined with `logical_and`, both must be true for a row to be retained. When conditions are combined with `logical_or`, then either one of them must be true for a row to be retained. Here are two different ways to select 18 and 19 year olds.

In [17]:
both.where(np.logical_or(both['AGE']==18, both['AGE']==19))

In [18]:
both.where(np.logical_and(both['AGE']>=18, both['AGE']<=19))

Here, we observe a rather dramatic decrease in the number of 18 and 19 year olds in the United States; the children of the baby boom are now even older.

**Aggregation and Grouping.** This particular dataset includes entries for sums across all ages and sexes, using the special values `999` and `0` respectively. However, if these rows did not exist, we would be able to aggregate the remaining entries.

In [19]:
no_sums = both.select(['SEX', 'AGE', '2014']).where(both['AGE'] != 999)
females = no_sums.where('SEX', 2).select(['AGE', '2014'])
sum(females['2014'])

161920569

Some columns express categories, such as the sex or age group in the case of the census table. Aggregation can also be performed on every value for a category using the `group` and `groups` methods. The `group` method takes a single column (or column name) as an argument and collects all values associated with each unique value in that column.

In [20]:
no_sums.group('AGE')

A second argument, the name of a function, can be provided to `group` in order to aggregate the resulting values. For exmaple, the `sum` function can be used to add together the populations for each age. In this result, the `SEX sum` column is meaningless because the values were simply codes for different categories. However, the `2014 sum` column does in fact contain the total number across all sexes for each age category.

In [21]:
no_sums.group('AGE', sum)

**Joining Tables.** There are many situations in data analysis in which two different rows need to be considered together. Two tables can be joined into one, an operation that creates one long row out of two matching rows. These matching rows can be from the same table or different tables.

For example, we might want to estimate which age categories are expected to change significantly in the future. Someone who is 14 years old in 2014 will be 20 years old in 2020. Therefore, one estimate of the number of 20 year olds in 2020 is the number of 14 year olds in 2014. Between the ages of 1 and 50, annual mortality rates are very low (less than 0.5% for men and less than 0.3% for women [[1](http://www.ssa.gov/oact/STATS/table4c6.html)]). Immigration also affects population changes, but for now we will ignore this confounding factor. Let's consider just females in this analysis.

In [22]:
females['AGE+6'] = females['AGE'] + 6
females

In order to relate the age in 2014 to the age in 2020, we will join this table with itself, matching values in the `AGE` column with values in the `AGE in 2020` column.

In [28]:
joined = females.join('AGE', females, 'AGE+6')
joined

The resulting table has five columns. The first three are the same as before. The two new colums are the values for `AGE` and `2014` that appeared in a different row, the one in which that `AGE` appeared in the `AGE+6` column. For instance, the first row contains the number of 6 year olds in 2014 and an estimate of the number of 6 year olds in 2020 (who were 0 in 2014). Some relabeling and selecting makes this table more clear.

In [29]:
future = joined.select(['AGE', '2014', '2014_2']).relabel('2014_2', '2020 (est)')
future

Adding a `Change` column and sorting by that change describes some of the major changes in age categories that we can expect in the United States for people under 50. According to this simplistic analysis, there will be substantially more people in their late 30's by 2020.

In [30]:
predictions = future.where(future['AGE'] < 50)
predictions['Change'] = predictions['2020 (est)'] - predictions['2014']
predictions.sort('Change', descending=True)